# tsotne sartania 
# მოკლედ ჩემი მოფიქრებული დავალაება:  შექმენით 10 მათემატიკური შეკითხვა მომხმარებლისთვის 
# მაგალითად( 67-43=?,  86+23=?  5*18=?  და ასეშემდეგ  .......  რომ პასუხები იყოს რიცხვები)
# შემდეგ გააკეთეთ ისე რომ ყოველი მცდარი ან  სწორი პასუხის შემდეგ 
# პასუხის ქვემოთ ეწერებოდეს სწორია ან არასწორია ხოლო ტესტის დასრულების შემდეგ 
# თუ 10 ივე  კითხვის პასუხი იქნება ჭეშმარიტი დაიპრინტოს "შენ აშკარად GOA ში სწავლობდი ჩემო ძმაო".
# ხოლო თუ ამ 10 პასუხიდან 1 მაინც იქნება მცდარი
# დაიპრინტოს ..."კიდევს სცადეთ ან შემოგვიერთდი GOA ში, GOA ელს ეს არეკადრება"  ... წარმატებები მეგობრებო
sum=0
task1=int(input("1+1= "))
if task1==2:
    sum+=1
    print("sworia")
else:
    print("mcdaria")

task2=int(input("2+2= "))
if task2 == 4:
    sum+=1
    print("sworia")
else:
    print("mcdaria")  

task3=int(input("10+10= "))
if task3 == 20:
    sum+=1
    print("sworia")
else:
    print("mcdaria")

task4=int(input("4*4= "))
if task4 == 16:
    sum+=1
    print("sworia") 
else:
    print("mcdaria")

task5=int(input("25/5= "))
if task5 == 5:
    sum+=1
    print("sworia") 
else:
    print("mcdaria")        
if sum == 5:
    print("შენ აშკარად GOA ში სწავლობდი ჩემო ძმაო")
else:
    print("კიდევს სცადეთ ან შემოგვიერთდი GOA ში, GOA ელს ეს არეკადრება")