# 1)

# შექმენით სია, ამ სიაში ჩაწერეთ სხვადასხვა ციფრები 
# (1, 2, 3, 4, ასე არა, რამე მაგ: 45, 23, 87, 55,) და გამოიტანეთ ამ სიაში ყველა რიცხვის ჯამი, 
# ასევე ამავე სიიდან უნდა დაპრინტოთ ყველა რიცხვი ცალ ცალკე და მიუწეროთ ლუწია თუ კენტი.

list=[45,23,87,55]
print(list[0]+list[1]+list[2]+list[3])

if list[0]==45:
    print(str(list[0])+" "+"kentia")
if list[1]==23:
    print(str(list[1])+" "+"kentia")
if list[2]==87:
    print(str(list[2])+" "+"kentia")
if list[3]==55:
     print(str(list[3])+" "+"kentia")